name: "identity"
backend: "oneflow"
max_batch_size: 1
input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [ 10 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 10 ]
  }
]

instance_group [
  { 
    count: 1
    kind: KIND_CPU
  }
]

parameters {
  key: "xrt"
  value: {
    string_value: "openvino"
  }
}
